; domain
(define (domain robot-world)
    (:requirements :strips :typing)
    (:types room robot)
    
    (:predicates
        (at ?r - robot ?p - room)
        (connected ?from - room ?to - room)
        (dirty ?p - room)
        (clean ?p - room)
    )
    
    (:action move
        :parameters (?r - robot ?from ?to - room)
        :precondition (and (at ?r ?from) (connected ?from ?to))
        :effect (and (not (at ?r ?from)) (at ?r ?to))
    )

    (:action clean
        :parameters (?r - robot ?p - room)
        :precondition (and (at ?r ?p) (dirty ?p))
        :effect (and (not (dirty ?p)) (clean ?p))
    )
)

; problem
(define (problem robot-clean-problem)
    (:domain robot-world)
    
    (:objects
        pokoj1 pokoj2 pokoj3 - room
        robo - robot
    )
    
    (:init
        (at robo pokoj1)
        (connected pokoj1 pokoj2)
        (connected pokoj2 pokoj1)
        (connected pokoj1 pokoj3)
        (connected pokoj3 pokoj1)
        (dirty pokoj1)
        (dirty pokoj2)
        (dirty pokoj3)
    )
    
    (:goal (and (clean pokoj1) (clean pokoj2) (clean pokoj3)))
)

; plan
1. (clean robo pokoj1)
   deleted: (dirty pokoj1)
   added: (clean pokoj1)
   goals met: 1 of 3
2. (move robo pokoj1 pokoj2)
   deleted: (at robo pokoj1)
   added: (at robo pokoj2)
   goals met: 1 of 3
3. (clean robo pokoj2)
   deleted: (dirty pokoj2)
   added: (clean pokoj2)
   goals met: 2 of 3
4. (move robo pokoj2 pokoj1)
   deleted: (at robo pokoj2)
   added: (at robo pokoj1)
   goals met: 2 of 3
5. (move robo pokoj1 pokoj3)
   deleted: (at robo pokoj1)
   added: (at robo pokoj3)
   goals met: 2 of 3
6. (clean robo pokoj3)
   deleted: (dirty pokoj3)
   added: (clean pokoj3)
   goals met: 3 of 3
